Revit 2026 API

# IViewSheetSetOrderedViewList Property

---

Ordered views.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
IReadOnlyList<View> OrderedViewList { get; set; }
```
```vb
Property OrderedViewList As IReadOnlyList(Of View)
	Get
	Set
```
```cpp
property IReadOnlyList<View^>^ OrderedViewList {
	IReadOnlyList<View^>^ get ();
	void set (IReadOnlyList<View^>^ value);
}
```
```fsharp
abstract OrderedViewList : IReadOnlyList<View> with get, set
```

#### Property Value

IReadOnlyListView

| Exception | Condition |
| --- | --- |
| ArgumentNullException | Thrown when the input ordered view list is . |
| InvalidOperationException | Thrown when the set operation failed due to invalid view which cannot be printed. |

#### Reference

IViewSheetSet Interface

Autodesk.Revit.DB Namespace